ninety_nine_cats/app/views/cats/_cat.html.erb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1  [["cat_id", 3]]
---
  <tbody>
    <% cat.rental_requests.each do |request| %>