ninety_nine_cats/app/controllers/cat_rental_requests_controller.rb

  def index
    #@cat = Cat.find(params[:cat_id])
    @cat_rental_requests = CatRentalRequest.where(cat_id: params[:cat_id])
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1  [["cat_id", 3]]

  def show
    @cat_rental_request = CatRentalRequest.find(params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    @cats = Cat.all
---
SELECT "cats".* FROM "cats"

  def edit
    @cats = Cat.all
    @cat_rental_request = CatRentalRequest.find(params[:id])
---
SELECT "cats".* FROM "cats"
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @cats = Cat.all
    @cat_rental_request = CatRentalRequest.new(cat_rental_request_params)
    if @cat_rental_request.save
---
SELECT "cats".* FROM "cats"
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 3], ["start_date", "2018-11-01"], ["end_date", "2018-12-31"], ["created_at", "2018-09-12 00:19:05.807161"], ["updated_at", "2018-09-12 00:19:05.807161"]]