ninety_nine_cats/app/controllers/cats_controller.rb

  def update
    @cat = Cat.find(params[:id])
    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["color", "Black\n"], ["updated_at", "2018-09-11 21:38:04.427105"], ["id", 1]]